MAXLII/ATOMAN/platform/hc32f558/Firmware/HC32_LL_Driver/inc/hc32_ll_sdfm.h
/**
 *******************************************************************************
 * @file hc32_ll_sdfm.h
 * @brief This file contains all the functions prototypes of the SDFM driver
 *        library.
  @verbatim
   Change Logs:
   Date             Author          Notes
   2026-04-16       CDT             First version
  @endverbatim
 *******************************************************************************
 * Copyright (C) 2022-2026, Xiaohua Semiconductor Co., Ltd. All rights reserved.
 *
 * This software component is licensed by XHSC under BSD 3-Clause license
 * (the "License"); You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                    opensource.org/licenses/BSD-3-Clause
 *
 *******************************************************************************
 */
#ifndef __HC32_LL_SDFM_H__
#define __HC32_LL_SDFM_H__

/* C binding of definitions if building with C++ compiler */
#ifdef __cplusplus
extern "C"
{
#endif

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32_ll_def.h"

#include "hc32f5xx.h"
#include "hc32f5xx_conf.h"
    /**
     * @addtogroup LL_Driver
     * @{
     */

    /**
     * @addtogroup LL_SDFM
     * @{
     */

#if (LL_SDFM_ENABLE == DDL_ON)

    /*******************************************************************************
     * Global type definitions ('typedef')
     ******************************************************************************/
    /**
     * @defgroup SDFM_Global_Types SDFM Global Types
     * @{
     */
    /**
     * @brief SDFM channel initialization structure
     */
    typedef struct
    {
        uint32_t u32InputMux;          /*!< Specifies input data multiplexer.
                                                     This parameter can be a value of @ref SDFM_Ch_Input_Data_Mux */
        uint32_t u32DataPacking;       /*!< Specifies data packing mode for input data.
                                                     This parameter can be a value of @ref SDFM_Ch_Input_Data_Packing */
        uint32_t u32InputSel;          /*!< Specifies channel input selection.
                                                     This parameter can be a value of @ref SDFM_Ch_Input */
        uint32_t u32SerialIntfType;    /*!< Specifies serial interface type.
                                                     This parameter can be a value of @ref SDFM_Ch_Serial_Intf_Type
                                                     The internal SDFM clock must be at least 4 times faster than the external
                                                     serial clock if standard SPI coding is used, and 6 times faster than the
                                                     external serial clock if Manchester coding is used. */
        uint32_t u32SpiClock;          /*!< Specifies SPI clock when u32SerialIntfType is SDFM_CH_SERIAL_INTF_SPI_xxxx
                                                     This parameter can be a value of @ref SDFM_Ch_SPI_Clk */
        int32_t i32CalOffset;          /*!< Specifies calibration offset.
                                                     This parameter must be a number between -8388608 and 8388607. */
        uint32_t u32RightBitShift;     /*!< Specifies right bit-shift.
                                                     The value of this parameter is related to the parameters of @ref stc_sdfm_filter_sinc_t
                                                     This parameter must be a number between 0 and 31.
                                                     0-31: Defines the shift of the data result coming from the integrator - how many
                                                     bit shifts to the right will be performed to have final results. Bit-shift is performed
                                                     before offset correction. The data shift is rounding the result to nearest integer value.
                                                     The sign of shifted result is maintained(to have valid 24-bit signed format of result data). */
        uint32_t u32ClockSel;          /*!< Channel clock selection.
                                                     This parameter can be a value of @ref SDFM_Ch_Clk_Sel */
        uint32_t u32ClockSync;         /*!< Enable/Disable clock synchronization.
                                                     This parameter can be a value of @ref SDFM_Ch_Clk_Sync_Ctrl */
        uint32_t u32DataSync;          /*!< Enable/Disable data synchronization.
                                                     This parameter can be a value of @ref SDFM_Ch_Data_Sync_Ctrl */
        int16_t i16CrossZeroThreshold; /*!< Specifies cross zero threshold.
                                                     The channel value after filtered by fast sinc filter, minus this threshold,
                                                     can generate cross zero interrupt if crossing zero occurred and the interrupt enabled.
                                                     This parameter must be a number between -32768 and 32767 */
    } stc_sdfm_ch_init_t;

    /**
     * @brief SDFM filter AWD parameters structure
     */
    typedef struct
    {
        uint32_t u32DataSrc;         /*!< Values from digital filter or from channel watchdog filter.
                                             This parameter can be a value of @ref SDFM_Filter_Awd_Data_Src */
        int32_t i32HighThreshold;    /*!< Analog watchdog high threshold.
                                             This parameter must be a number between -8388608 and 8388607 */
        int32_t i32LowThreshold;     /*!< Analog watchdog low threshold.
                                             This parameter must be a number between -8388608 and 8388607 */
        int16_t i16HighThreshold2;   /*!< Analog watchdog high threshold2.
                                             This parameter must be a number between -32768 and 32767 */
        int16_t i16LowThreshold2;    /*!< Analog watchdog low threshold2.
                                             This parameter must be a number between -32768 and 32767 */
        uint32_t u32HighBreakSignal; /*!< Break signal assignment to analog watchdog high threshold event.
                                             This parameter is also used to assign CEVT1 to break signal.
                                             This parameter can be any combination of @ref SDFM_Break_Signal */
        uint32_t u32LowBreakSignal;  /*!< Break signal assignment to analog watchdog low threshold event.
                                             This parameter is also used to assign CEVT2 to break signal.
                                             This parameter can be any combination of @ref SDFM_Break_Signal */
        uint32_t u32CrossZeroBreakSignal; /*!< Break signal assignment to cross zero event.
                                             This parameter can be any combination of @ref SDFM_Break_Signal */
    } stc_sdfm_filter_awd_t;

    /**
     * @brief SDFM filter regular conversion parameters structure
     */
    typedef struct
    {
        uint32_t u32RegularCh; /*!< Regular channel selection.
                                                     This parameter can be a value of @ref SDFM_Channel */
        uint32_t u32FastMode;  /*!< Enable/disable fast mode for regular conversion.
                                                     This parameter can be a value of @ref SDFM_Filter_Regu_Fast_Mode_Ctrl */
        uint32_t u32DmaRead;   /*!< Enable/disable DMA channel to read data for the regular conversion.
                                                     This parameter can be a value of @ref SDFM_Filter_Regu_Dma_Ctrl */
        uint32_t u32SyncStart; /*!< Enable/disable to launch regular conversion synchronously with SDFM_FLT0.
                                                     This parameter can be a value of @ref SDFM_Filter_Regu_Sync_Ctrl */
        uint32_t u32ContMode;  /*!< Enable/Disable continuous mode selection for regular conversions.
                                                     This parameter can be a value of @ref SDFM_Filter_Regu_Cont_Ctrl */
    } stc_sdfm_filter_regular_conv_t;

    /**
     * @brief SDFM filter injected conversion parameters structure
     */
    typedef struct
    {
        uint32_t u32InjectedCh;     /*!< Injected channel group selection.
                                                     This parameter is ignored if u32Type == SDFM_FILTER_INJ_TYPE_FIFO, the channel
                                                     specified by u32RegularCh of @ref stc_sdfm_filter_regular_conv_t is used as injected channel.
                                                     This parameter can be any combination of @ref SDFM_Channel_Mult */
        uint32_t u32ExtTrigger;     /*!< Trigger signal selection for launching injected conversions.
                                                     This parameter can be a value of @ref SDFM_Filter_Ext_Trigger */
        uint32_t u32ExtTriggerEdge; /*!< Trigger enable and trigger edge selection for injected conversions.
                                                     External trigger edge: rising, falling or both
                                                     This parameter can be a value of @ref SDFM_Filter_Ext_Trigger_Edge */
        uint32_t u32DmaRead;        /*!< Enable/disable DMA channel to read data for the injected channel group.
                                                     This parameter can be a value of @ref SDFM_Filter_Inj_Dma_Ctrl */
        uint32_t u32ScanMode;       /*!< Scanning conversion mode for injected conversions.
                                                     This parameter can be a value of @ref SDFM_Filter_Inj_Scan_Mode_Ctrl */
        uint32_t u32SyncStart;      /*!< Enable/disable to launch an injected conversion synchronously with the SDFM_FLT0 JSWSTART trigger.
                                                     This parameter can be a value of @ref SDFM_Filter_Inj_Sync_Ctrl */
        uint32_t u32Type;           /*!< Injected Conversion type.
                                                     This parameter can be a value of @ref SDFM_Filter_Inj_Type */
    } stc_sdfm_filter_injected_conv_t;

    /**
     * @brief SDFM filter control parameter structure
     */
    typedef struct
    {

        uint32_t u32SincOrder; /*!< Sinc filter order.
                                                     This parameter can be a value of @ref SDFM_Filter_Sinc_Order */
        uint32_t u32SincFOSR;  /*!< Sinc filter oversampling ratio (decimation rate).
                                                     This parameter must be a number between 1 and 1024:
                                                     1~1024: for FastSinc, Sinc1~Sinc3
                                                     1~215: for Sinc4
                                                     1~73: for Sinc5 */
        uint32_t u32SincIOSR;  /*!< Integrator oversampling ratio (averaging length).
                                                     This parameter must be a number between 1 and 256 */
    } stc_sdfm_filter_sinc_t;

    /**
     * @brief SDFM filter FIFO configuration structure
     */
    typedef struct
    {
        uint32_t u32IntLevel;       /*!< Interrupt level.
                                                     The FIFO will generate an interrupt when the FIFO status (SDFFST) > fifo level (SDFFIL).
                                                     This parameter can be a value between 0 and 15. */
        uint32_t u32WaitForSync;    /*!< FIFO Wait for synchronization.
                                                     This parameter can be a value of @ref SDFM_Filter_Fifo_Wait_For_Sync */
        uint32_t u32ClearOnSync;    /*!< Clear FIFO on synchronization.
                                                     This parameter can be a value of @ref SDFM_Filter_Fifo_Clear_On_Sync */
        uint32_t u32FlagClearOnInt; /*!< Wait-for-Sync Flag FIFO on interrupt.
                                                     This parameter can be a value of @ref SDFM_Filter_Fifo_Flag_Clear_On_Int */
    } stc_sdfm_filter_fifo_config_t;

    /**
     * @brief SDFM filter comparator event configuration structure
     */
    typedef struct
    {
        en_functional_state_t enIntState; /*!< Enable/Disable comparator event interrupt */
        uint32_t u32InputSel;             /*!< Comparator event input selection.
                                                         This parameter can be a value of @ref SDFM_Filter_Cevt_Input_Sel */
        uint32_t u32OutputSel;            /*!< Comparator event output selection.
                                                         This parameter can be a value of @ref SDFM_Filter_Cevt_Output_Sel */
        uint32_t u32SampleWindow;         /*!< Filter sample window size.
                                                         This parameter must be a number between 1 and 32.
                                                         The CEVT latches the register and sequentially inputs the auxiliary filter's
                                                         output into a 32-bit FIFO with a depth of u32SampleWindow.
                                                         If the count of 1s is not less than u32VotingThreshold, the filter outputs 1.
                                                         If the count of 0s is not less than u32VotingThreshold, the filter outputs 0. */
        uint32_t u32VotingThreshold;      /*!< Filter majority voting threshold.
                                                         This parameter must be a number between 0 and 31.
                                                         For proper operation, this parameter must be greater than u32SampleWindow/2,
                                                         and less than or equal to u32SampleWindow. */
        /* Do assign CEVT break signal via parameter 'u32HighBreakSignal' and 'u32LowBreakSignal' of @ref stc_sdfm_filter_awd_t */
    } stc_sdfm_filter_cevt_config_t;

    /**
     * @brief SDFM filter initialization structure
     */
    typedef struct
    {
        /* Configures the conversion that needed, regular conversion or injected conversion or both */
        stc_sdfm_filter_regular_conv_t stcReguConv; /*!< Regular conversion parameters structure. */

        stc_sdfm_filter_injected_conv_t stcInjConv; /*!< Injected conversion parameters structure. */

        stc_sdfm_filter_sinc_t stcSinc; /*!< Sinc filter parameters structure. */

        uint32_t u32OvfDeal; /*!< Filter overflow deal.
                                                             This parameter can be a value of @ref SDFM_Filter_Ovf_Deal */
    } stc_sdfm_filter_init_t;

/**
 * @}
 */

