MAXLII/ATOMAN/platform/hc32f558/Firmware/HC32_LL_Driver/inc/hc32_ll_sdfm.h
/*******************************************************************************
 * Global pre-processor symbols/macros ('#define')
 ******************************************************************************/
/**
 * @defgroup SDFM_Global_Macros SDFM Global Macros
 * @{
 */

/**
 * @defgroup SDFM_Channel SDFM Channel Definition
 * @{
 */
#define SDFM_CH0 (0U) /*!< SDFM channel 0. */
#define SDFM_CH1 (1U) /*!< SDFM channel 1. */
#define SDFM_CH2 (2U) /*!< SDFM channel 2. */
#define SDFM_CH3 (3U) /*!< SDFM channel 3. */
#define SDFM_CH4 (4U) /*!< SDFM channel 4. */
#define SDFM_CH5 (5U) /*!< SDFM channel 5. */
#define SDFM_CH6 (6U) /*!< SDFM channel 6. */
#define SDFM_CH7 (7U) /*!< SDFM channel 7. */
/**
 * @}
 */

/**
 * @defgroup SDFM_Channel_Mult SDFM Channel Multiple Definition
 * @{
 */
#define SDFM_MX_CH0    (1UL << SDFM_CH0) /*!< Select SDFM channel 0. */
#define SDFM_MX_CH1    (1UL << SDFM_CH1) /*!< Select SDFM channel 1. */
#define SDFM_MX_CH2    (1UL << SDFM_CH2) /*!< Select SDFM channel 2. */
#define SDFM_MX_CH3    (1UL << SDFM_CH3) /*!< Select SDFM channel 3. */
#define SDFM_MX_CH4    (1UL << SDFM_CH4) /*!< Select SDFM channel 4. */
#define SDFM_MX_CH5    (1UL << SDFM_CH5) /*!< Select SDFM channel 5. */
#define SDFM_MX_CH6    (1UL << SDFM_CH6) /*!< Select SDFM channel 6. */
#define SDFM_MX_CH7    (1UL << SDFM_CH7) /*!< Select SDFM channel 7. */
#define SDFM_MX_CH_ALL (0xFFUL)          /*!< Select all channels. */
/**
 * @}
 */

/**
 * @defgroup SDFM_Filter SDFM Filter Definition
 * @{
 */
#define SDFM_FILTER0 (0U) /*!< Filter 0 of SDFM. */
#define SDFM_FILTER1 (1U) /*!< Filter 1 of SDFM. */
#define SDFM_FILTER2 (2U) /*!< Filter 2 of SDFM. */
#define SDFM_FILTER3 (3U) /*!< Filter 3 of SDFM. */
/**
 * @}
 */

/**
 * @defgroup SDFM_Filter_Cevt SDFM Filter Comparator Event
 * @{
 */
#define SDFM_FILTER_CEVT1 (0U) /*!< SDFM Filter Comparator Event 1. */
#define SDFM_FILTER_CEVT2 (1U) /*!< SDFM Filter Comparator Event 2. */
/**
 * @}
 */

/**
 * @defgroup SDFM_Ch_Output_Clk_Src SDFM Channel Output Clock Source
 * @{
 */
#define SDFM_CH_OUTPUT_CLK_SYS   (0x0U) /*!< Source for output clock is from system clock */
#define SDFM_CH_OUTPUT_CLK_AUDIO (SDFM_CHCFGR1_CKOUTSRC) /*!< Source for output clock is from audio clock */
/**
 * @}
 */

/**
 * @defgroup SDFM_Ch_Input_Data_Mux SDFM Channel Input Data Multiplexer
 * @{
 */
#define SDFM_CH_INPUT_DATA_EXT        (0x0U) /*!< Data to channel y are taken from external serial inputs as 1-bit values. */
#define SDFM_CH_INPUT_DATA_INTERN_REG (SDFM_CHCFGR1_DATMPX_1) /*!< Data to channel y are taken from internal SDFM_CHyDATINR register by direct CPU/DMA write. */
/**
 * @}
 */

/**
 * @defgroup SDFM_Ch_Input_Data_Packing SDFM Channel Input Data Packing
 * @{
 */
#define SDFM_CH_INPUT_DATA_PACKING_STD         (0x0U) /*!< Standard data packing mode.
                                                                                     Input data in SDFM_CHyDATINR register are stored only in INDAT0[15:0].
                                                                                     To empty SDFM_CHyDATINR register, one sample must be read by the SDFM filter from channel y. */
#define SDFM_CH_INPUT_DATA_PACKING_INTERLEAVED (SDFM_CHCFGR1_DATPACK_0) /*!< Interleaved data packing mode.
                                                                                     Input data in SDFM_CHyDATINR register are stored as two samples:
                                                                                     - first sample in INDAT0[15:0] (assigned to channel y),
                                                                                     - second sample INDAT1[15:0] (assigned to channel y).
                                                                                     To empty SDFM_CHyDATINR register, two samples must be read by the digital filter from channel y
                                                                                     (INDAT0[15:0] part is read as first sample and then INDAT1[15:0] part is read as next sample). */
#define SDFM_CH_INPUT_DATA_PACKING_DUAL        (SDFM_CHCFGR1_DATPACK_1) /*!< Dual data packing mode.
                                                                                     Input data in SDFM_CHyDATINR register are stored as two samples:
                                                                                     - first sample INDAT0[15:0] (assigned to channel y),
                                                                                     - second sample INDAT1[15:0] (assigned to channel y+1).
                                                                                     To empty SDFM_CHyDATINR register, first sample must be read by the digital filter from channel y
                                                                                     and second sample must be read by another digital filter from channel y+1.
                                                                                     Dual mode is available only on even channel numbers (y = 0, 2, 4, 6),
                                                                                     for odd channel numbers (y = 1, 3, 5, 7) SDFM_CHyDATINR is write protected.
                                                                                     If an even channel is set to dual mode then the following odd channel must be set into standard
                                                                                     mode (DATPACK[1:0]=0) for correct cooperation with even channel. */
/**
 * @}
 */

/**
 * @defgroup SDFM_Ch_Input SDFM Channel Input Selection
 * @{
 */
#define SDFM_CH_INPUT_PIN_SAME_CH_PIN   (0x0U) /*!< Channel inputs are taken from pins of the same channel */
#define SDFM_CH_INPUT_PIN_FOLLOW_CH_PIN (SDFM_CHCFGR1_CHINSEL) /*!< Channel inputs are taken from pins of the following channel (channel (y+1) modulo 8) */
/**
 * @}
 */

/**
 * @defgroup SDFM_Ch_Serial_Intf_Type SDFM Channel Serial Interface Type
 * @{
 */
#define SDFM_CH_SERIAL_INTF_SPI_RISING         (0x0U) /*!< SPI with rising edge to strobe data */
#define SDFM_CH_SERIAL_INTF_SPI_FALLING        (SDFM_CHCFGR1_SITP_0) /*!< SPI with falling edge to strobe data */
#define SDFM_CH_SERIAL_INTF_MANCHESTER_RISING  (SDFM_CHCFGR1_SITP_1) /*!< Manchester coded input on DATINy pin: rising edge = logic 0, falling edge = logic 1 */
#define SDFM_CH_SERIAL_INTF_MANCHESTER_FALLING (SDFM_CHCFGR1_SITP)   /*!< Manchester coded input on DATINy pin: rising edge = logic 1, falling edge = logic 0 */
/**
 * @}
 */

/**
 * @defgroup SDFM_Ch_SPI_Clk SDFM Channel SPI Clock
 * @{
 */
#define SDFM_CH_SPI_CLK_EXT                 (0x0U) /*!< SPI clock coming from external CKINy input - sampling point according SITP[1:0] */
#define SDFM_CH_SPI_CLK_INTERN              (SDFM_CHCFGR1_SPICKSEL_0) /*!< SPI clock coming from internal CKOUT output - sampling point according SITP[1:0] */
#define SDFM_CH_SPI_CLK_INTERN_DIV2_FALLING (SDFM_CHCFGR1_SPICKSEL_1) /*!< SPI clock coming from internal CKOUT - sampling point on each second CKOUT falling edge. */
#define SDFM_CH_SPI_CLK_INTERN_DIV2_RISING  (SDFM_CHCFGR1_SPICKSEL) /*!< SPI clock coming from internal CKOUT output - sampling point on each second CKOUT rising edge. */
/**
 * @}
 */

/**
 * @defgroup SDFM_Ch_Clk_Sel SDFM Channel Clock Selection
 * @{
 */
#define SDFM_CH_CLK_SEL_SELF (0x0U) /*!< Clock source is its channel clock */
#define SDFM_CH_CLK_SEL_CH0  (SDFM_CHCFGR1_SDCLKSEL) /*!< Clock source is channel 0 clock */
/**
 * @}
 */

/**
 * @defgroup SDFM_Ch_Clk_Sync_Ctrl SDFM Channel Clock Synchronization Control
 * @{
 */
#define SDFM_CH_CLK_SYNC_DISABLE (0x0U) /*!< Channel clock is not passed through a synchronizer */
#define SDFM_CH_CLK_SYNC_ENABLE  (SDFM_CHCFGR1_SDCLKSYNC) /*!< Channel clock is passed through a synchronizer */
/**
 * @}
 */

/**
 * @defgroup SDFM_Ch_Data_Sync_Ctrl SDFM Channel Data Synchronization Control
 * @{
 */
#define SDFM_CH_DATA_SYNC_DISABLE (0x0U) /*!< Channel data is not passed through a synchronizer */
#define SDFM_CH_DATA_SYNC_ENABLE  (SDFM_CHCFGR1_SDDATASYNC) /*!< Channel data is passed through a synchronizer */
/**
 * @}
 */

/**
 * @defgroup SDFM_Ch_Awd_Sinc_Order SDFM Channel Analog Watchdog Filter Order
 * @{
 */
#define SDFM_CH_AWD_SINC_ORDER_FASTSINC (0x0U) /*!< FastSinc filter type */
#define SDFM_CH_AWD_SINC_ORDER_SINC1    (SDFM_CHAWSCDR_AWFORD_0) /*!< Sinc1 filter type */
#define SDFM_CH_AWD_SINC_ORDER_SINC2    (SDFM_CHAWSCDR_AWFORD_1) /*!< Sinc2 filter type */
#define SDFM_CH_AWD_SINC_ORDER_SINC3    (SDFM_CHAWSCDR_AWFORD)   /*!< Sinc3 filter type */
/**
 * @}
 */

/**
 * @defgroup SDFM_Break_Signal SDFM Break Signal
 * @{
 */
#define SDFM_BREAK_SIGNAL_NONE (0x0U)  /*!< No break signal */
#define SDFM_BREAK_SIGNAL0     (0x1UL) /*!< Break signal 0 */
#define SDFM_BREAK_SIGNAL1     (0x2UL) /*!< Break signal 1 */
#define SDFM_BREAK_SIGNAL2     (0x4UL) /*!< Break signal 2 */
#define SDFM_BREAK_SIGNAL3     (0x8UL) /*!< Break signal 3 */
/**
 * @}
 */

/**
 * @defgroup SDFM_Filter_Ext_Trigger SDFM Filter External Trigger
 * @{
 */
#define SDFM_FILTER_EXT_TRIG_JTRG0  (0x00U) /*!< HRPWM_GLOB_AOS0 */
#define SDFM_FILTER_EXT_TRIG_JTRG1  (0x01U) /*!< HRPWM_GLOB_AOS1 */
#define SDFM_FILTER_EXT_TRIG_JTRG2  (0x02U) /*!< HRPWM_GLOB_AOS2 */
#define SDFM_FILTER_EXT_TRIG_JTRG3  (0x03U) /*!< HRPWM_GLOB_AOS3 */
#define SDFM_FILTER_EXT_TRIG_JTRG4  (0x04U) /*!< HRPWM_GLOB_AOS4 */
#define SDFM_FILTER_EXT_TRIG_JTRG5  (0x05U) /*!< HRPWM_GLOB_AOS5 */
#define SDFM_FILTER_EXT_TRIG_JTRG6  (0x06U) /*!< HRPWM_GLOB_AOS6 */
#define SDFM_FILTER_EXT_TRIG_JTRG7  (0x07U) /*!< HRPWM_GLOB_AOS7 */
#define SDFM_FILTER_EXT_TRIG_JTRG8  (0x08U) /*!< HRPWM_GLOB_AOS8 */
#define SDFM_FILTER_EXT_TRIG_JTRG9  (0x09U) /*!< TMR6_1_SCMA */
#define SDFM_FILTER_EXT_TRIG_JTRG10 (0x0AU) /*!< TMR6_2_SCMA */
#define SDFM_FILTER_EXT_TRIG_JTRG11 (0x0BU) /*!< TMR6_3_SCMA */
#define SDFM_FILTER_EXT_TRIG_JTRG12 (0x0CU) /*!< TMR6_4_SCMA */
#define SDFM_FILTER_EXT_TRIG_JTRG13 (0x0DU) /*!< TMR6_5_SCMA */
#define SDFM_FILTER_EXT_TRIG_JTRG14 (0x0EU) /*!< TMR6_6_SCMA */
#define SDFM_FILTER_EXT_TRIG_JTRG15 (0x0FU) /*!< TMR6_1_SCMB */
#define SDFM_FILTER_EXT_TRIG_JTRG16 (0x10U) /*!< TMR6_2_SCMB */
#define SDFM_FILTER_EXT_TRIG_JTRG17 (0x11U) /*!< TMR6_3_SCMB */
#define SDFM_FILTER_EXT_TRIG_JTRG18 (0x12U) /*!< TMR6_4_SCMB */
#define SDFM_FILTER_EXT_TRIG_JTRG19 (0x13U) /*!< TMR6_5_SCMB */
#define SDFM_FILTER_EXT_TRIG_JTRG20 (0x14U) /*!< TMR6_6_SCMB */
#define SDFM_FILTER_EXT_TRIG_JTRG24 (0x18U) /*!< EXTI1 */
#define SDFM_FILTER_EXT_TRIG_JTRG25 (0x19U) /*!< EXTI2 */
#define SDFM_FILTER_EXT_TRIG_JTRG26 (0x1AU) /*!< TMR0_1_CMPA */
#define SDFM_FILTER_EXT_TRIG_JTRG27 (0x1BU) /*!< TMR0_1_CMPB */
#define SDFM_FILTER_EXT_TRIG_JTRG28 (0x1CU) /*!< TMR0_1_OVFA */
#define SDFM_FILTER_EXT_TRIG_JTRG29 (0x1DU) /*!< TMR0_2_CMPA */
#define SDFM_FILTER_EXT_TRIG_JTRG30 (0x1EU) /*!< TMR0_2_CMPB */
#define SDFM_FILTER_EXT_TRIG_JTRG31 (0x1FU) /*!< TMR0_2_OVFA */
/**
 * @}
 */

/**
 * @defgroup SDFM_Filter_Ext_Trigger_Edge SDFM Filter External Trigger Edge
 * @{
 */
#define SDFM_FILTER_EXT_TRIG_DISABLE      (0x0U) /*!< Trigger detection is disabled */
#define SDFM_FILTER_EXT_TRIG_EDGE_RISING  (SDFM_FLTCR1_JEXTEN_0) /*!< Each rising edge on the selected trigger makes a request to launch an injected conversion */
#define SDFM_FILTER_EXT_TRIG_EDGE_FALLING (SDFM_FLTCR1_JEXTEN_1) /*!< Each falling edge on the selected trigger makes a request to launch an injected conversion */
#define SDFM_FILTER_EXT_TRIG_EDGE_BOTH    (SDFM_FLTCR1_JEXTEN) /*!< Both rising edges and falling edges on the selected trigger make requests to launch injected conversions */
/**
 * @}
 */

/**
 * @defgroup SDFM_Filter_Regu_Fast_Mode_Ctrl SDFM Filter Regular Fast Mode Control
 * @{
 */
#define SDFM_FILTER_REGU_FAST_MD_DISABLE (0x0U)             /*!< Fast conversion mode for regular conversion is disabled. */
#define SDFM_FILTER_REGU_FAST_MD_ENABLE  (SDFM_FLTCR1_FAST) /*!< Fast conversion mode for regular conversion is enabled. */
/**
 * @}
 */

/**
 * @defgroup SDFM_Filter_Regu_Dma_Ctrl SDFM Filter Regular DMA Control
 * @{
 */
#define SDFM_FILTER_REGU_DMA_DISABLE (0x0U) /*!< The DMA channel is not enabled to read regular data. */
#define SDFM_FILTER_REGU_DMA_ENABLE  (SDFM_FLTCR1_RDMAEN) /*!< The DMA channel is enabled to read regular data. */
/**
 * @}
 */

/**
 * @defgroup SDFM_Filter_Regu_Sync_Ctrl SDFM Filter Regular Sync Control
 * @{
 */
#define SDFM_FILTER_REGU_SYNC_START_DISABLE (0x0U) /*!< Do not launch a regular conversion synchronously with SDFM_FLT0. */
#define SDFM_FILTER_REGU_SYNC_START_ENABLE  (SDFM_FLTCR1_RSYNC) /*!< Launch a regular conversion in this SDFM_FLTx at the very moment when
                                                                                     a regular conversion is launched in SDFM_FLT0. */
/**
 * @}
 */

/**
 * @defgroup SDFM_Filter_Regu_Cont_Ctrl SDFM Filter Regular Continuous Mode Control
 * @{
 */
#define SDFM_FILTER_REGU_CONT_MD_DISABLE (0x0U) /*!< The regular channel is converted just once for each conversion request. */
#define SDFM_FILTER_REGU_CONT_MD_ENABLE  (SDFM_FLTCR1_RCONT) /*!< The regular channel is converted repeatedly after each conversion request. */
/**
 * @}
 */

/**
 * @defgroup SDFM_Filter_Inj_Sync_Ctrl SDFM Filter Injected Sync Control
 * @{
 */
#define SDFM_FILTER_INJ_SYNC_START_DISABLE (0x0U) /*!< Do not launch an injected conversion synchronously with SDFM_FLT0. */
#define SDFM_FILTER_INJ_SYNC_START_ENABLE  (SDFM_FLTCR1_JSYNC) /*!< Launch an injected conversion in this SDFM_FLTx at the very moment when an injected
                                                                                     conversion is launched in SDFM_FLT0 by its JSWSTART trigger. */
/**
 * @}
 */

/**
 * @defgroup SDFM_Filter_Inj_Scan_Mode_Ctrl SDFM Filter Injected Scan Mode Control
 * @{
 */
#define SDFM_FILTER_INJ_SCAN_MD_DISABLE (0x0U) /*!< One channel conversion is performed from the injected channel group and next
                                                                                     the selected channel from this group is selected. */
#define SDFM_FILTER_INJ_SCAN_MD_ENABLE  (SDFM_FLTCR1_JSCAN) /*!< The series of conversions for the injected group channels is executed,
                                                                                     starting over with the lowest selected channel. */
/**
 * @}
 */

/**
 * @defgroup SDFM_Filter_Inj_Dma_Ctrl SDFM Filter Injected DMA
 * @{
 */
#define SDFM_FILTER_INJ_DMA_DISABLE (0x0U) /*!< The DMA channel is not enabled to read injected data. */
#define SDFM_FILTER_INJ_DMA_ENABLE  (SDFM_FLTCR1_JDMAEN) /*!< The DMA channel is enabled to read injected data. */
/**
 * @}
 */

/**
 * @defgroup SDFM_Filter_Inj_Type SDFM Filter Injected Conversion Type
 * @{
 */
#define SDFM_FILTER_INJ_TYPE_COMM (0x0U) /*!< Common injected conversion. */
#define SDFM_FILTER_INJ_TYPE_FIFO (SDFM_FLTCR1_JSCAN_TYPE) /*!< FIFO injected conversion. */
/**
 * @}
 */

/**
 * @defgroup SDFM_Filter_Sinc_Order SDFM Filter Sinc Order
 * @{
 */
#define SDFM_FILTER_SINC_ORDER_FASTSINC (0x0U) /*!< FastSinc filter type */
#define SDFM_FILTER_SINC_ORDER_SINC1    (1UL << SDFM_FLTFCR_FORD_POS) /*!< Sinc1 filter type */
#define SDFM_FILTER_SINC_ORDER_SINC2    (2UL << SDFM_FLTFCR_FORD_POS) /*!< Sinc2 filter type */
#define SDFM_FILTER_SINC_ORDER_SINC3    (3UL << SDFM_FLTFCR_FORD_POS) /*!< Sinc3 filter type */
#define SDFM_FILTER_SINC_ORDER_SINC4    (4UL << SDFM_FLTFCR_FORD_POS) /*!< Sinc4 filter type */
#define SDFM_FILTER_SINC_ORDER_SINC5    (5UL << SDFM_FLTFCR_FORD_POS) /*!< Sinc5 filter type */
/**
 * @}
 */

/**
 * @defgroup SDFM_Filter_Awd_Data_Src SDFM Filter Analog Watchdog Data Source
 * @{
 */
#define SDFM_FILTER_AWD_FILTER_DATA (0x0U) /*!< Analog watchdog on data output value (after the digital filter).
                                                                                     The comparison is done after offset correction and shift */
#define SDFM_FILTER_AWD_CH_DATA     (SDFM_FLTCR1_AWFSEL) /*!< Analog watchdog on channel transceivers value (after watchdog filter) */
/**
 * @}
 */

/**
 * @defgroup SDFM_Filter_Ovf_Deal SDFM Filter Overflow Deal
 * @{
 */
#define SDFM_FILTER_OVF_CLAMPING (0x0U) /*!< If the conversion result is greater than the maximum value, then take the maximum value.
                                                                                     If the conversion result is less than the minimum value, then take the minimum value. */
#define SDFM_FILTER_OVF_CUTTING  (SDFM_FLTCR1_OVDEL) /*!< Cut off the highest position */
/**
 * @}
 */

/**
 * @defgroup SDFM_Filter_Int SDFM Filter Interrupt
 * @{
 */
#define SDFM_FILTER_INT_INJ_EOC       (SDFM_FLTCR2_JEOCIE) /*!< Injected end of conversion interrupt */
#define SDFM_FILTER_INT_REGU_EOC      (SDFM_FLTCR2_REOCIE) /*!< Regular end of conversion interrupt */
#define SDFM_FILTER_INT_INJ_OVERRUN   (SDFM_FLTCR2_JOVRIE) /*!< Injected data overrun interrupt */
#define SDFM_FILTER_INT_REGU_OVERRUN  (SDFM_FLTCR2_ROVRIE) /*!< Regular data overrun interrupt */
#define SDFM_FILTER_INT_AWD           (SDFM_FLTCR2_AWDIE)  /*!< Analog watchdog interrupt */
#define SDFM_FILTER_INT_CH_CROSS_ZERO (1UL << 31U)         /*!< Cross zero interrupt of the channel which the filter used */

