MAXLII/ATOMAN/platform/hc32f558/Firmware/HC32_LL_Driver/inc/hc32_ll_sdfm.h
#define SDFM_FILTER_INT_ALL                                                                                          \
    (SDFM_FILTER_INT_INJ_EOC | SDFM_FILTER_INT_REGU_EOC | SDFM_FILTER_INT_INJ_OVERRUN | SDFM_FILTER_INT_REGU_OVERRUN \
     | SDFM_FILTER_INT_AWD | SDFM_FILTER_INT_CH_CROSS_ZERO)
/**
 * @}
 */

/**
 * @defgroup SDFM_Filter_Ch_Int SDFM Filter Channel Interrupt
 * @{
 */
#define SDFM_FILTER_CH_INT_SCD  (SDFM_FLTCR2_SCDIE)  /*!< Short-circuit detector interrupt */
#define SDFM_FILTER_CH_INT_CKAB (SDFM_FLTCR2_CKABIE) /*!< Clock absence interrupt */
#define SDFM_FILTER_CH_INT_ALL  (SDFM_FILTER_CH_INT_SCD | SDFM_FILTER_CH_INT_CKAB)
/**
 * @}
 */

/**
 * @defgroup SDFM_Filter_Status_Flag SDFM Filter Status Flag
 * @{
 */
#define SDFM_FILTER_FLAG_INJ_EOC      (SDFM_FLTISR_JEOCF) /*!< End of injected conversion flag.
                                                                                     Need cleared by software only when FIFO injected conversion used(SDFM_FLTxCR1.JSCAN_TYPE=1) */
#define SDFM_FILTER_FLAG_REGU_EOC     (SDFM_FLTISR_REOCF) /*!< End of regular conversion flag */
#define SDFM_FILTER_FLAG_INJ_OVERRUN  (SDFM_FLTISR_JOVRF) /*!< Injected conversion overrun flag */
#define SDFM_FILTER_FLAG_REGU_OVERRUN (SDFM_FLTISR_ROVRF) /*!< Regular conversion overrun flag */
#define SDFM_FILTER_FLAG_AWD          (SDFM_FLTISR_AWDF)  /*!< The analog watchdog block detected voltage which crosses the value
                                                                                     programmed in the SDFM_FLTxAWLTR or SDFM_FLTxAWHTR registers.
                                                                                     This bit is set by hardware. It is cleared by software by clearing
                                                                                     all source flag bits AWHTF[7:0] and AWLTF[7:0] in SDFM_FLTxAWSR
                                                                                     register (by writing ‘1’ into the clear bits in SDFM_FLTxAWCFR register). */
#define SDFM_FILTER_FLAG_INJ_BUSY     (SDFM_FLTISR_JCIP)  /*!< Injected conversion in progress */
#define SDFM_FILTER_FLAG_REGU_BUSY    (SDFM_FLTISR_RCIP)  /*!< Regular conversion in progress */

#define SDFM_FILTER_FLAG_ALL                                                             \
    (SDFM_FILTER_FLAG_INJ_EOC | SDFM_FILTER_FLAG_REGU_EOC | SDFM_FILTER_FLAG_INJ_OVERRUN \
     | SDFM_FILTER_FLAG_REGU_OVERRUN | SDFM_FILTER_FLAG_AWD | SDFM_FILTER_FLAG_INJ_BUSY | SDFM_FILTER_FLAG_REGU_BUSY)
#define SDFM_FILTER_FLAG_CLR_ALL \
    (SDFM_FILTER_FLAG_INJ_EOC | SDFM_FILTER_FLAG_INJ_OVERRUN | SDFM_FILTER_FLAG_REGU_OVERRUN)
/**
 * @}
 */

/**
 * @defgroup SDFM_Filter_Ch_Status_Flag SDFM Filter Channel Status Flag
 * @{
 */
#define SDFM_FILTER_CH_FLAG_CKAB_CH0 (1UL << 16U) /*!< Clock absence is detected on channel 0 */
#define SDFM_FILTER_CH_FLAG_CKAB_CH1 (1UL << 17U) /*!< Clock absence is detected on channel 1 */
#define SDFM_FILTER_CH_FLAG_CKAB_CH2 (1UL << 18U) /*!< Clock absence is detected on channel 2 */
#define SDFM_FILTER_CH_FLAG_CKAB_CH3 (1UL << 19U) /*!< Clock absence is detected on channel 3 */
#define SDFM_FILTER_CH_FLAG_CKAB_CH4 (1UL << 20U) /*!< Clock absence is detected on channel 4 */
#define SDFM_FILTER_CH_FLAG_CKAB_CH5 (1UL << 21U) /*!< Clock absence is detected on channel 5 */
#define SDFM_FILTER_CH_FLAG_CKAB_CH6 (1UL << 22U) /*!< Clock absence is detected on channel 6 */
#define SDFM_FILTER_CH_FLAG_CKAB_CH7 (1UL << 23U) /*!< Clock absence is detected on channel 7 */
#define SDFM_FILTER_CH_FLAG_CKAB_ALL (0x00FF0000UL)

#define SDFM_FILTER_CH_FLAG_SCD_CH0 (1UL << 24U) /*!< Short-circuit detector event occurred on channel 0 */
#define SDFM_FILTER_CH_FLAG_SCD_CH1 (1UL << 25U) /*!< Short-circuit detector event occurred on channel 1 */
#define SDFM_FILTER_CH_FLAG_SCD_CH2 (1UL << 26U) /*!< Short-circuit detector event occurred on channel 2 */
#define SDFM_FILTER_CH_FLAG_SCD_CH3 (1UL << 27U) /*!< Short-circuit detector event occurred on channel 3 */
#define SDFM_FILTER_CH_FLAG_SCD_CH4 (1UL << 28U) /*!< Short-circuit detector event occurred on channel 4 */
#define SDFM_FILTER_CH_FLAG_SCD_CH5 (1UL << 29U) /*!< Short-circuit detector event occurred on channel 5 */
#define SDFM_FILTER_CH_FLAG_SCD_CH6 (1UL << 30U) /*!< Short-circuit detector event occurred on channel 6 */
#define SDFM_FILTER_CH_FLAG_SCD_CH7 (1UL << 31U) /*!< Short-circuit detector event occurred on channel 7 */
#define SDFM_FILTER_CH_FLAG_SCD_ALL (0xFF000000UL)

#define SDFM_FILTER_CH_FLAG_ALL (SDFM_FILTER_CH_FLAG_CKAB_ALL | SDFM_FILTER_CH_FLAG_SCD_ALL)
/**
 * @}
 */

/**
 * @defgroup SDFM_Filter_Awd_Status_Flag SDFM Filter Analog Watchdog Status Flag
 * @{
 */
#define SDFM_FILTER_AWD_FLAG_LT_CH0 (1UL << 0U) /*!< A low threshold error on channel 0 */
#define SDFM_FILTER_AWD_FLAG_LT_CH1 (1UL << 1U) /*!< A low threshold error on channel 1 */
#define SDFM_FILTER_AWD_FLAG_LT_CH2 (1UL << 2U) /*!< A low threshold error on channel 2 */
#define SDFM_FILTER_AWD_FLAG_LT_CH3 (1UL << 3U) /*!< A low threshold error on channel 3 */
#define SDFM_FILTER_AWD_FLAG_LT_CH4 (1UL << 4U) /*!< A low threshold error on channel 4 */
#define SDFM_FILTER_AWD_FLAG_LT_CH5 (1UL << 5U) /*!< A low threshold error on channel 5 */
#define SDFM_FILTER_AWD_FLAG_LT_CH6 (1UL << 6U) /*!< A low threshold error on channel 6 */
#define SDFM_FILTER_AWD_FLAG_LT_CH7 (1UL << 7U) /*!< A low threshold error on channel 7 */

#define SDFM_FILTER_AWD_FLAG_HT_CH0 (1UL << 8U)  /*!< A high threshold error on channel 0 */
#define SDFM_FILTER_AWD_FLAG_HT_CH1 (1UL << 9U)  /*!< A high threshold error on channel 1 */
#define SDFM_FILTER_AWD_FLAG_HT_CH2 (1UL << 10U) /*!< A high threshold error on channel 2 */
#define SDFM_FILTER_AWD_FLAG_HT_CH3 (1UL << 11U) /*!< A high threshold error on channel 3 */
#define SDFM_FILTER_AWD_FLAG_HT_CH4 (1UL << 12U) /*!< A high threshold error on channel 4 */
#define SDFM_FILTER_AWD_FLAG_HT_CH5 (1UL << 13U) /*!< A high threshold error on channel 5 */
#define SDFM_FILTER_AWD_FLAG_HT_CH6 (1UL << 14U) /*!< A high threshold error on channel 6 */
#define SDFM_FILTER_AWD_FLAG_HT_CH7 (1UL << 15U) /*!< A high threshold error on channel 7 */

#define SDFM_FILTER_AWD_FLAG_HZF_CH0 (1UL << 16U) /*!< A crossing zero on channel 0 */
#define SDFM_FILTER_AWD_FLAG_HZF_CH1 (1UL << 17U) /*!< A crossing zero on channel 1 */
#define SDFM_FILTER_AWD_FLAG_HZF_CH2 (1UL << 18U) /*!< A crossing zero on channel 2 */
#define SDFM_FILTER_AWD_FLAG_HZF_CH3 (1UL << 19U) /*!< A crossing zero on channel 3 */
#define SDFM_FILTER_AWD_FLAG_HZF_CH4 (1UL << 20U) /*!< A crossing zero on channel 4 */
#define SDFM_FILTER_AWD_FLAG_HZF_CH5 (1UL << 21U) /*!< A crossing zero on channel 5 */
#define SDFM_FILTER_AWD_FLAG_HZF_CH6 (1UL << 22U) /*!< A crossing zero on channel 6 */
#define SDFM_FILTER_AWD_FLAG_HZF_CH7 (1UL << 23U) /*!< A crossing zero on channel 7 */

#define SDFM_FILTER_AWD_FLAG_HT_ALL  (0x0000FFUL)
#define SDFM_FILTER_AWD_FLAG_LT_ALL  (0x00FF00UL)
#define SDFM_FILTER_AWD_FLAG_HZF_ALL (0xFF0000UL)
#define SDFM_FILTER_AWD_FLAG_ALL     (0xFFFFFFUL)
/**
 * @}
 */

/**
 * @defgroup SDFM_Filter_Cevt_Input_Sel SDFM Filter Comparator Event Input Selection
 * @{
 */
#define SDFM_FILTER_CEVT1_INPUT_COMPH1           (0x0UL) /*!< Comparator event1 input selects COMPH1 */
#define SDFM_FILTER_CEVT1_INPUT_COMPH1_OR_COMPL1 (0x1UL) /*!< Comparator event1 input selects COMPH1 or COMPL1 */
#define SDFM_FILTER_CEVT1_INPUT_COMPH2           (0x2UL) /*!< Comparator event1 input selects COMPH2 */
#define SDFM_FILTER_CEVT1_INPUT_COMPH2_OR_COMPL2 (0x3UL) /*!< Comparator event1 input selects COMPH2 or COMPL2 */

#define SDFM_FILTER_CEVT2_INPUT_COMPL1           (0x0UL) /*!< Comparator event2 input selects COMPL1 */
#define SDFM_FILTER_CEVT2_INPUT_COMPL1_OR_COMPH1 (0x1UL) /*!< Comparator event2 input selects COMPL1 or COMPH1 */
#define SDFM_FILTER_CEVT2_INPUT_COMPL2           (0x2UL) /*!< Comparator event2 input selects COMPL2 */
#define SDFM_FILTER_CEVT2_INPUT_COMPL2_OR_COMPH2 (0x3UL) /*!< Comparator event2 input selects COMPL2 or COMPH2 */
/**
 * @}
 */

/**
 * @defgroup SDFM_Filter_Cevt_Output_Sel SDFM Filter Comparator Event Output Selection
 * @{
 */
#define SDFM_FILTER_CEVT_OUTPUT_RAW      (0x0UL) /*!< Comparator event output selects the raw event not filtered */
#define SDFM_FILTER_CEVT_OUTPUT_FILTERED (0x1UL) /*!< Comparator event output selects the raw event after filtered */
/**
 * @}
 */

/**
 * @defgroup SDFM_Filter_Fifo_Wait_For_Sync SDFM Filter FIFO Wait For Synchronization
 * @{
 */
#define SDFM_FILTER_FIFO_WAIT_FOR_SYNC_DISABLE (0x0UL) /*!< Incoming Data written to SDFIFO on every Data-Ready(DR) Event */
#define SDFM_FILTER_FIFO_WAIT_FOR_SYNC_ENABLE  (SDFM_FLTFIFOCTL_WTSYNCEN) /*!< Incoming Data written to SDFIFO on DR event only after SDFM_JTRG event occurs */
/**
 * @}
 */

/**
 * @defgroup SDFM_Filter_Fifo_Clear_On_Sync SDFM Filter FIFO Clear On Synchronization
 * @{
 */
#define SDFM_FILTER_FIFO_CLR_ON_SYNC_DISABLE (0x0UL) /*!< FIFO is not automatically cleared upon receiving SDFM_JTRG */
#define SDFM_FILTER_FIFO_CLR_ON_SYNC_ENABLE  (SDFM_FLTFIFOCTL_FFSYNCLREN) /*!< FIFO is automatically cleared upon receiving SDFM_JTRG */
/**
 * @}
 */

/**
 * @defgroup SDFM_Filter_Fifo_Flag_Clear_On_Int SDFM Filter FIFO Flag Clear On Interrupt
 * @{
 */
#define SDFM_FILTER_FIFO_FLAG_CLR_ON_INT_DISABLE (0x0UL) /*!< WTSYNFLAG can only be cleared manually */
#define SDFM_FILTER_FIFO_FLAG_CLR_ON_INT_ENABLE  (SDFM_FLTFIFOCTL_WTSCLREN) /*!< WTSYNFLAG is cleared automatically on JCIP(JSCAN_TYPE==1) */
/**
 * @}
 */

/**
 * @defgroup SDFM_Filter_Fifo_Flag SDFM Filter FIFO Flag
 * @{
 */
#define SDFM_FILTER_FIFO_FLAG_WAIT_FOR_SYNC (SDFM_FLTFIFOCTL_WTSYNFLG)
#define SDFM_FILTER_FIFO_FLAG_ALL           (SDFM_FILTER_FIFO_FLAG_WAIT_FOR_SYNC)
    /**
     * @}
     */

    /**
     * @}
     */

