MAXLII/ATOMAN/platform/hc32f558/Firmware/HC32_LL_Driver/inc/hc32_ll_sdfm.h
    /*******************************************************************************
     * Global variable definitions ('extern')
     ******************************************************************************/

    /*******************************************************************************
  Global function prototypes (definition in C source)
     ******************************************************************************/
    /**
     * @addtogroup SDFM_Global_Functions
     * @{
     */
    int32_t SDFM_CH_Init(CM_SDFM_TypeDef *SDFMx, uint32_t u32Ch, const stc_sdfm_ch_init_t *pstcSdfmChInit);
    int32_t SDFM_CH_StructInit(stc_sdfm_ch_init_t *pstcSdfmChInit);
    void SDFM_CH_Cmd(CM_SDFM_TypeDef *SDFMx, uint32_t u32Ch, en_functional_state_t enNewState);
    int32_t SDFM_FILTER_Init(CM_SDFM_TypeDef *SDFMx, uint32_t u32Filter,
                             const stc_sdfm_filter_init_t *pstcSdfmFilterInit);
    int32_t SDFM_FILTER_StructInit(stc_sdfm_filter_init_t *pstcSdfmFilterInit);
    void SDFM_FILTER_IntCmd(CM_SDFM_TypeDef *SDFMx,
                            uint32_t u32Filter,
                            uint32_t u32FilterInt,
                            en_functional_state_t enNewState);
    void SDFM_FILTER_ChIntCmd(CM_SDFM_TypeDef *SDFMx, uint32_t u32ChInt, en_functional_state_t enNewState);
    void SDFM_FILTER_Cmd(CM_SDFM_TypeDef *SDFMx, uint32_t u32Filter, en_functional_state_t enNewState);
    void SDFM_Cmd(CM_SDFM_TypeDef *SDFMx, en_functional_state_t enNewState);
    int32_t SDFM_DeInit(CM_SDFM_TypeDef *SDFMx);

    /***********************************************************************************************************************
     ***********************************************************************************************************************/
    void SDFM_CH_ClockOutConfig(CM_SDFM_TypeDef *SDFMx, uint32_t u32ClockOutSrc, uint32_t u32ClockOutDiv);
    void SDFM_CH_DisableClockOut(CM_SDFM_TypeDef *SDFMx);
    int32_t SDFM_CH_ClockAbsenceDetectorCmd(CM_SDFM_TypeDef *SDFMx, uint32_t u32Ch, en_functional_state_t enNewState);
    void SDFM_CH_ShortCircuitDetectorConfig(CM_SDFM_TypeDef *SDFMx,
                                            uint32_t u32Ch,
                                            uint32_t u32Threshold,
                                            uint32_t u32BreakSignal);
    void SDFM_CH_ShortCircuitDetectorCmd(CM_SDFM_TypeDef *SDFMx, uint32_t u32Ch, en_functional_state_t enNewState);
    void SDFM_CH_SelectInputMux(CM_SDFM_TypeDef *SDFMx, uint32_t u32Ch, uint32_t u32InputMux);
    void SDFM_CH_SetDataPacking(CM_SDFM_TypeDef *SDFMx, uint32_t u32Ch, uint32_t u32DataPacking);
    void SDFM_CH_SelectInput(CM_SDFM_TypeDef *SDFMx, uint32_t u32Ch, uint32_t u32InputSel);
    void SDFM_CH_SetSerialIntfType(CM_SDFM_TypeDef *SDFMx, uint32_t u32Ch, uint32_t u32IntfType);
    void SDFM_CH_SetSpiClock(CM_SDFM_TypeDef *SDFMx, uint32_t u32Ch, uint32_t u32SpiClk);
    void SDFM_CH_AwdConfig(CM_SDFM_TypeDef *SDFMx,
                           uint32_t u32Ch,
                           uint32_t u32AwdSincOrder,
                           uint32_t u32AwdSincFOSR);
    int16_t SDFM_CH_GetAwdValue(CM_SDFM_TypeDef *SDFMx, uint32_t u32Ch);
    void SDFM_CH_SetCalOffset(CM_SDFM_TypeDef *SDFMx, uint32_t u32Ch, int32_t i32CalOffset);
    void SDFM_CH_WriteInputDataStdMode(CM_SDFM_TypeDef *SDFMx, uint32_t u32Ch, int16_t i16InputData);
    void SDFM_CH_WriteInputDataInterleavedMode(CM_SDFM_TypeDef *SDFMx,
                                               uint32_t u32Ch,
                                               int16_t i16FirstSample,
                                               int16_t i16SecondSample);
    void SDFM_CH_WriteInputDataDualMode(CM_SDFM_TypeDef *SDFMx,
                                        uint32_t u32Ch,
                                        int16_t i16YSample,
                                        int16_t i16Y1Sample);
    void SDFM_CH_SetDelay(CM_SDFM_TypeDef *SDFMx, uint32_t u32Ch, uint8_t u8Delay);

    void SDFM_CH_ClockSelect(CM_SDFM_TypeDef *SDFMx, uint32_t u32Ch, uint32_t u32ClockSel);
    void SDFM_CH_ClockSyncCmd(CM_SDFM_TypeDef *SDFMx, uint32_t u32Ch, en_functional_state_t enNewState);
    void SDFM_CH_DataSyncCmd(CM_SDFM_TypeDef *SDFMx, uint32_t u32Ch, en_functional_state_t enNewState);

    /***********************************************************************************************************************
     ***********************************************************************************************************************/
    en_flag_status_t SDFM_FILTER_GetStatus(CM_SDFM_TypeDef *SDFMx, uint32_t u32Filter, uint32_t u32Flag);
    en_flag_status_t SDFM_FILTER_GetChStatus(CM_SDFM_TypeDef *SDFMx, uint32_t u32ChFlag);
    void SDFM_FILTER_ClearStatus(CM_SDFM_TypeDef *SDFMx, uint32_t u32Filter, uint32_t u32Flag);
    int32_t SDFM_FILTER_ClearChStatus(CM_SDFM_TypeDef *SDFMx, uint32_t u32ChFlag);
    int32_t SDFM_FILTER_RegularConvConfig(CM_SDFM_TypeDef *SDFMx, uint32_t u32Filter,
                                          const stc_sdfm_filter_regular_conv_t *pstcRegu);
    void SDFM_FILTER_RegularConvContModeCmd(CM_SDFM_TypeDef *SDFMx, uint32_t u32Filter,
                                            en_functional_state_t enNewState);
    void SDFM_FILTER_RegularConvSyncStartCmd(CM_SDFM_TypeDef *SDFMx, uint32_t u32Filter,
                                             en_functional_state_t enNewState);
    void SDFM_FILTER_RegularConvDmaReadCmd(CM_SDFM_TypeDef *SDFMx, uint32_t u32Filter,
                                           en_functional_state_t enNewState);
    void SDFM_FILTER_RegularConvFastModeCmd(CM_SDFM_TypeDef *SDFMx, uint32_t u32Filter,
                                            en_functional_state_t enNewState);
    void SDFM_FILTER_SetRegularConvCh(CM_SDFM_TypeDef *SDFMx, uint32_t u32Filter, uint32_t u32ReguCh);
    void SDFM_FILTER_StartRegularConv(CM_SDFM_TypeDef *SDFMx, uint32_t u32Filter);
    int32_t SDFM_FILTER_GetRegularConvValue(CM_SDFM_TypeDef *SDFMx, uint32_t u32Filter, uint32_t *pu32Ch);
    int32_t SDFM_FILTER_InjectedConvConfig(CM_SDFM_TypeDef *SDFMx, uint32_t u32Filter,
                                           const stc_sdfm_filter_injected_conv_t *pstcInj);
    void SDFM_FILTER_InjectedConvSyncStartCmd(CM_SDFM_TypeDef *SDFMx, uint32_t u32Filter,
                                              en_functional_state_t enNewState);
    void SDFM_FILTER_InjectedConvScanModeCmd(CM_SDFM_TypeDef *SDFMx, uint32_t u32Filter,
                                             en_functional_state_t enNewState);
    void SDFM_FILTER_InjectedConvDmaReadCmd(CM_SDFM_TypeDef *SDFMx, uint32_t u32Filter,
                                            en_functional_state_t enNewState);
    void SDFM_FILTER_SetInjectedConvType(CM_SDFM_TypeDef *SDFMx, uint32_t u32Filter, uint32_t u32InjType);
    void SDFM_FILTER_SetInjectedConvExtTrigger(CM_SDFM_TypeDef *SDFMx,
                                               uint32_t u32Filter,
                                               uint32_t u32ExtTrigger,
                                               uint32_t u32ExtTriggerEdge);
    void SDFM_FILTER_SetInjectedConvCh(CM_SDFM_TypeDef *SDFMx, uint32_t u32Filter, uint32_t u32InjCh);
    void SDFM_FILTER_StartInjectedConv(CM_SDFM_TypeDef *SDFMx, uint32_t u32Filter);
    int32_t SDFM_FILTER_GetInjectedConvValue(CM_SDFM_TypeDef *SDFMx, uint32_t u32Filter, uint32_t *pu32Ch);

