MAXLII/ATOMAN/platform/hc32f558/Firmware/HC32_LL_Driver/inc/hc32_ll_sdfm.h
    /***********************************************************************************************************************
     ***********************************************************************************************************************/
    int32_t SDFM_FILTER_FifoConfig(CM_SDFM_TypeDef *SDFMx, uint32_t u32Filter,
                                   const stc_sdfm_filter_fifo_config_t *pstcFifo);
    int32_t SDFM_FILTER_FifoStructInit(stc_sdfm_filter_fifo_config_t *pstcFifo);
    uint32_t SDFM_FILTER_GetFifoStatus(CM_SDFM_TypeDef *SDFMx, uint32_t u32Filter);
    int32_t SDFM_FILTER_ReadFifo(CM_SDFM_TypeDef *SDFMx, uint32_t u32Filter, uint32_t *pu32Ch);
    en_flag_status_t SDFM_FILTER_GetFifoFlagStatus(CM_SDFM_TypeDef *SDFMx, uint32_t u32Filter, uint32_t u32FifoFlag);
    void SDFM_FILTER_ClearFifoFlagStatus(CM_SDFM_TypeDef *SDFMx, uint32_t u32Filter, uint32_t u32FifoFlag);

    /***********************************************************************************************************************
     ***********************************************************************************************************************/
    int32_t SDFM_FILTER_CevtConfig(CM_SDFM_TypeDef *SDFMx,
                                   uint32_t u32Filter,
                                   uint32_t u32Cevt,
                                   const stc_sdfm_filter_cevt_config_t *pstcCevt);
    int32_t SDFM_FILTER_CevtStructInit(stc_sdfm_filter_cevt_config_t *pstcCevt);
    void SDFM_FILTER_ResetCevtDigitalFifo(CM_SDFM_TypeDef *SDFMx, uint32_t u32Filter);
    void SDFM_FILTER_CevtDigitalFilterSetInputCh(CM_SDFM_TypeDef *SDFMx, uint32_t u32Filter, uint32_t u32Ch);
    void SDFM_FILTER_CevtDigitalFilterCmd(CM_SDFM_TypeDef *SDFMx, uint32_t u32Filter, en_functional_state_t enNewState);

    /***********************************************************************************************************************
     ***********************************************************************************************************************/
    void SDFM_FILTER_ExtremesChCmd(CM_SDFM_TypeDef *SDFMx,
                                   uint32_t u32Filter,
                                   uint32_t u32ExtrCh,
                                   en_functional_state_t enNewState);
    void SDFM_FILTER_ResetExtremes(CM_SDFM_TypeDef *SDFMx, uint32_t u32Filter);
    int32_t SDFM_FILTER_GetExtremeMaxValue(CM_SDFM_TypeDef *SDFMx, uint32_t u32Filter, uint32_t *pu32Ch);
    int32_t SDFM_FILTER_GetExtremeMinValue(CM_SDFM_TypeDef *SDFMx, uint32_t u32Filter, uint32_t *pu32Ch);
    uint32_t SDFM_FILTER_GetConvTimeValue(CM_SDFM_TypeDef *SDFMx, uint32_t u32Filter);
    uint32_t SDFM_FILTER_GetConvThreValue(CM_SDFM_TypeDef *SDFMx, uint32_t u32Filter);
    int32_t SDFM_FILTER_AwdConfig(CM_SDFM_TypeDef *SDFMx, uint32_t u32Filter, const stc_sdfm_filter_awd_t *pstcAwd);
    int32_t SDFM_FILTER_AwdStructInit(stc_sdfm_filter_awd_t *pstcAwd);
    void SDFM_FILTER_AwdChCmd(CM_SDFM_TypeDef *SDFMx,
                              uint32_t u32Filter,
                              uint32_t u32AwdCh,
                              en_functional_state_t enNewState);
    void SDFM_FILTER_SetAwdDataSrc(CM_SDFM_TypeDef *SDFMx, uint32_t u32Filter, uint32_t u32DataSrc);
    void SDFM_FILTER_SetAwdThreshold(CM_SDFM_TypeDef *SDFMx,
                                     uint32_t u32Filter,
                                     int32_t i32HighThreshold,
                                     int32_t i32LowThreshold);
    void SDFM_FILTER_SetAwdThreshold2(CM_SDFM_TypeDef *SDFMx,
                                      uint32_t u32Filter,
                                      int16_t i16HighThreshold2,
                                      int16_t i16LowThreshold2);
    void SDFM_FILTER_SetAwdBreakSignal(CM_SDFM_TypeDef *SDFMx,
                                       uint32_t u32Filter,
                                       uint32_t u32HighBreakSignal,
                                       uint32_t u32LowBreakSignal,
                                       uint32_t u32CrossZeroBreakSignal);
    en_flag_status_t SDFM_FILTER_GetAwdStatus(CM_SDFM_TypeDef *SDFMx, uint32_t u32Filter, uint32_t u32Flag);
    void SDFM_FILTER_ClearAwdStatus(CM_SDFM_TypeDef *SDFMx, uint32_t u32Filter, uint32_t u32Flag);
    int32_t SDFM_FILTER_SincConfig(CM_SDFM_TypeDef *SDFMx, uint32_t u32Filter, const stc_sdfm_filter_sinc_t *pstcSinc);

    /**
     * @}
     */

#endif /* LL_SDFM_ENABLE */

    /**
     * @}
     */

    /**
     * @}
     */

#ifdef __cplusplus
}
#endif

#endif /* __HC32_LL_SDFM_H__ */

/*******************************************************************************
 * EOF (not truncated)
 ******************************************************************************/
